_posts/2013-10-29-Add-subheadings-to-all-headings-in-an-org-file-at-some-level.html
---
title: Add subheadings to all headings in an org-file at some level
date: 2013/10/29 10:05:25
updated: 2013/10/29 14:25:45
categories: org-mode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Class One</a>
<ul>
<li><a href="#sec-1-1">1.1. Student 1</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Essay One</a></li>
<li><a href="#sec-1-1-2">1.1.2. Essay 2</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Student 2</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Essay 2</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Student 3</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Essay One</a></li>
<li><a href="#sec-1-3-2">1.3.2. Essay 2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Class Two</a>
<ul>
<li><a href="#sec-2-1">2.1. Student 1</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Essay 2</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Student 2</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Essay 2</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<p>
On the org-mode mailing list someone asked how to insert a sub-heading with properties at some level in a tree. The application is they have a tree they use to store grades for a class, and they want to easily add a new level for an assignment for each student. The new level will have a title, and some properties to store the grade in. 
</p>

<p>
This can be done with <code>org-map-entries</code>. This will visit all the headlines and run a function. For this example, students are at level 3, and we want to add a headline at level 4 with the title "Essay 2", and with a property for the grade. The following code does this. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let</span> ((MATCH t)
      (SCOPE 'file)
      (SKIP nil)
      (spacing nil))
  (org-map-entries
             (<span style="color: #8b0000;">lambda</span> ()
               (<span style="color: #8b0000;">let</span> ((level (nth 1 (org-heading-components))))
                 (<span style="color: #8b0000;">if</span> (= level 3)                     
                     (<span style="color: #8b0000;">save-restriction</span>
                       (org-narrow-to-subtree)
                       (goto-char (point-max))
                       
                       (org-insert-heading)
                       (insert <span style="color: #228b22;">"Essay 2\n"</span>)
                       (org-entry-put (point) <span style="color: #228b22;">"GRADE"</span> nil)
                       <span style="color: #ff0000; font-weight: bold;">;; </span><span style="color: #ff0000; font-weight: bold;">now cut tree and paste at level 4</span>
                       (org-cut-subtree)
                       (org-paste-subtree 4)
                       )))) MATCH SCOPE SKIP))
</pre>
</div>

<p>
This code does not check for duplicates, so if you run it again, you get another set of entries for Essay 2. That might actually be hard to prevent without setting a unique ID for each new entry, something like Student-Name-Essay-2.
</p>

<p>
I found it necessary to cut and paste the new subtree to get to the level I wanted because in Class two, there were not already subtrees at level 4, and the code above went into a recursion loop.
</p>

<p>
I could not figure out why I had to narrow to the subtree, and go to the end of that subtree. Without doing that there was another recursion loop.
</p>

<p>
Below here is a slightly modified subtree showing a structure of two courses an instructor might have, with students in headlines at level 3. The code above has already added headlines at level 4 for "Essay 2". You have to check out the <a href="/media/2013-10-29-Add-subheadings-to-all-headings-in-an-org-file-at-some-level/add-subheadings-to-headings.org">actual org-file</a> to see that the properties are there.
</p>

<p>
For application, the code above could be put in an emacs-lisp file as an interactive command you could call with M-x.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Class One</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Student 1</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Essay One</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Here is my comment to the student on their essay.  The grade/mark itself will be stored as a property or priority.
&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;HERE I'd like to add a node for "Essay Two"
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Essay 2</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Student 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Comment on John's essay.
&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; I to add the same node skeleton here, automatically
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Essay 2</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Student 3</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Essay One</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Comment on Sally's essay.
&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; And here.
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Essay 2</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Class Two</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Student 1</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Essay 2</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Student 2</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Essay 2</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
</div>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/10/29/Add-subheadings-to-all-headings-in-an-org-file-at-some-level.org">org-mode source</a><p>